{
  "meta": {
    "Home": {
      "title": "Front-End Web Developer - Portfolio Website",
      "description": "Welcome to my portfolio website showcasing my frontend development skills.",
      "keywords": "frontend developer portfolio, Vue.js developer, React.js developer, hire frontend developer, JavaScript expert, web developer portfolio, UI/UX web developer, Sasha Sohrabi web developer"
    },
    "Portfolio": {
      "title": "My Work - Frontend Projects",
      "description": "Explore my frontend projects including Vue.js, Nuxt.js, and React work.",
      "keywords": "frontend projects, Vue.js projects, React.js portfolio, modern web applications, JavaScript projects, UI/UX case studies, web development showcase, responsive design examples, best frontend practices, CSS animations and interactions"
    },
    "ContactMe": {
      "title": "Contact Me - Get in Touch",
      "description": "Want to discuss a project or job opportunity? Get in touch with me through my contact page.",
      "keywords": "contact frontend developer, hire web developer, contact Sasha Sohrabi"
    }
  },
  "menuLinks": [
    { "name": "Home", "path": "/" },
    { "name": "Portfolio", "path": "/portfolio" },
    { "name": "Contact Me", "path": "/contact" }
  ],
  "banner": {
    "title": "Front-End Web Developer",
    "description": "with a passion for learning",
    "backgroundImageUrl": "src/assets/images/banner.jpg"
  },
  "about": {
    "title": "About Me",
    "fullName": "Sasha Sohrabi",
    "description": "I am a passionate Frontend Developer with extensive experience in building efficient, scalable web applications using modern technologies such as JavaScript, TypeScript, Vue.js, Nuxt.js, and React.js. Throughout my career, I have focused on crafting sophisticated web components, optimizing performance, and ensuring seamless user experiences across diverse projects for international clients.\n\nDriven by a strong commitment to continuous professional growth, I thrive in dynamic environments where innovation and collaboration are valued. I excel in adapting to various team settings and take pride in delivering clean, maintainable code while meeting tight deadlines. My hands-on experience with CI/CD pipelines, testing frameworks, and modern development methodologies ensures I can contribute effectively to both frontend-focused and full-stack projects.\n\nCurrently, I am seeking new opportunities where I can leverage my frontend expertise with Vue.js and React.js while expanding my backend knowledge with Node.js. I am particularly interested in roles that challenge me technically and allow me to work within inclusive teams that prioritize cutting-edge solutions and ongoing learning.",
    "resumeButton": {
      "text": "Download My Resume",
      "fileName": "Sasha_Sohrabi_Resume.pdf"
    },
    "imageUrl": "src/assets/images/section-image.jpeg",
    "videoUrl": {
      "mp4": "src/assets/videos/bg-video.mp4",
      "webm": "src/assets/videos/bg-video.webm"
    }
  },
  "footer": {
    "text": "Copyright ©2025 My Portfolio by Sasha Sohrabi."
  }
}
